---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.ColumnInsideWall
source: html/849563f7-1341-8fba-91df-58edbfbb7335.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.ColumnInsideWall Property

One element is completely inside another.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnInsideWall { get; }
```